<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2024 广东卓锐软件有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://www.dolphinphp.com
// +----------------------------------------------------------------------
// | 作者: 蔡伟明 <314013107@qq.com>
// +----------------------------------------------------------------------
declare (strict_types=1);

namespace form\fieldset;

use app\common\abstract\FormType;

/**
 * 字段集组件
 */
class Fieldset extends FormType
{
    /**
     * 设置表单项类型
     * @var string
     */
    protected string $type = 'fieldset';
}
