<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 河源市卓锐科技有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------
// | 产品许可：公开源码可访问，个人非商业免费，商业使用按域名授权
// +----------------------------------------------------------------------

return [
    // 产品信息
    'name'      => 'DolphinPHP',
    'version'   => '2.0.0-dev',
    'website'   => 'https://www.dolphinphp.com',
    'update'    => 'https://www.dolphinphp.com/checkUpdate',

    // 公司信息
    'company_name'    => '广东卓锐软件有限公司',
    'company_website' => 'http://www.zrthink.com',
];
