<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2019 广东卓锐软件有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------

/**
 * 图标相关
 */
return [
    // 允许添加自定义图标地址的域名
    'domains' => ['at.alicdn.COM'],
    // 允许添加自定义图标地址的后缀
    // 如果要添加的图标地址没有后缀，可设置为空数组，即不检查地址是否包含后缀
    'suffix'  => ['css']
];
