<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2026 广东卓锐软件有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://www.dolphinphp.com
// +----------------------------------------------------------------------
// | 作者: 蔡伟明 <314013107@qq.com>
// +----------------------------------------------------------------------
declare (strict_types=1);

// 后台应用语言包
return [
    'dp#login failed'                   => '登录失败，请刷新页面重试！',
    'dp#username or password incorrect' => '账号或密码不正确',
    'dp#captcha failed'                 => '验证码错误或失效',
    'dp#user disabled'                  => '当前用户已被禁用',
    'dp#username require'               => '账号不能为空',
    'dp#password require'               => '密码不能为空',
    'dp#invalid parameter'              => '参数错误',
];
